```
table_name AS alias_name
```
```
table_name alias_name
```

In [7]:
import ipynb_importer
%run pg_00_common.ipynb
cursor = pg_connect()

In [2]:
sql = """
SELECT f.title
FROM film AS f
ORDER BY f.title
LIMIT 5;
"""
run_sql(cursor, sql)

              title
0  Academy Dinosaur
1    Ace Goldfinger
2  Adaptation Holes
3  Affair Prejudice
4       African Egg

In [3]:
sql = """
SELECT 
  c.customer_id, 
  c.first_name, 
  p.amount, 
  p.payment_date 
FROM 
  customer c 
  INNER JOIN payment p ON p.customer_id = c.customer_id 
ORDER BY 
  p.payment_date DESC;
"""
run_sql(cursor, sql)

       customer_id first_name amount               payment_date
0               94      Norma   4.99 2007-05-14 13:44:29.996577
1              264  Gwendolyn   2.99 2007-05-14 13:44:29.996577
2              263      Hilda   0.99 2007-05-14 13:44:29.996577
3              252     Mattie   4.99 2007-05-14 13:44:29.996577
4              251     Vickie   0.99 2007-05-14 13:44:29.996577
...            ...        ...    ...                        ...
14591           49      Joyce   0.99 2007-02-14 21:44:52.996577
14592          592   Terrance   6.99 2007-02-14 21:41:12.996577
14593          239     Minnie   4.99 2007-02-14 21:29:00.996577
14594          516      Elmer   4.99 2007-02-14 21:23:39.996577
14595          416    Jeffery   2.99 2007-02-14 21:21:59.996577

[14596 rows x 4 columns]

# self-join

self-join 时，需要用到表别名

In [8]:
sql = """
SELECT
    f1.film_id,
    f1.title,
    f2.title,
    f1.length
FROM
    film f1
INNER JOIN film f2 
    ON f1.film_id <> f2.film_id AND 
       f1.length = f2.length;
"""
run_sql(cursor, sql)

      film_id             title                   title  length
0         133   Chamber Italian  Resurrection Silverado     117
1         133   Chamber Italian          Magic Mallrats     117
2         133   Chamber Italian           Graffiti Love     117
3         133   Chamber Italian        Affair Prejudice     117
4         384  Grosse Wonderful        Hurricane Affair      49
...       ...               ...                     ...     ...
6967     1000         Zorro Ark             Muppet Mile      50
6968     1000         Zorro Ark              Lion Uncut      50
6969     1000         Zorro Ark        Crossing Divorce      50
6970     1000         Zorro Ark          Blues Instinct      50
6971     1000         Zorro Ark        Adaptation Holes      50

[6972 rows x 4 columns]